Yeshore/STM32_BluetoothSmartLight/Project/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define Key_8_Pin GPIO_PIN_12
#define Key_8_GPIO_Port GPIOB
#define Key_7_Pin GPIO_PIN_13
#define Key_7_GPIO_Port GPIOB
#define Key_6_Pin GPIO_PIN_14
#define Key_6_GPIO_Port GPIOB
#define Key_5_Pin GPIO_PIN_15
#define Key_5_GPIO_Port GPIOB
#define Key_4_Pin GPIO_PIN_8
#define Key_4_GPIO_Port GPIOA
#define Key_3_Pin GPIO_PIN_9
#define Key_3_GPIO_Port GPIOA
#define Key_2_Pin GPIO_PIN_10
#define Key_2_GPIO_Port GPIOA
#define Key_1_Pin GPIO_PIN_11
#define Key_1_GPIO_Port GPIOA
#define HCSR505_IO_Pin GPIO_PIN_12
#define HCSR505_IO_GPIO_Port GPIOA
#define LED_VCC_Pin GPIO_PIN_3
#define LED_VCC_GPIO_Port GPIOB
#define LED_GND_Pin GPIO_PIN_4
#define LED_GND_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
